app/views/OWS/Security/UpdateQuestion.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:sec="http://webservices.micros.com/ows/5.1/Security.wsdl">
   <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <sec:UpdateQuestionRequest>
         <sec:NameID type="INTERNAL">{NameID}</sec:NameID>
         <sec:LoginCredentials loginName="{loginName}" password="{password}"/>
         <sec:Question questionId="{questionId}">{Question}</sec:Question>
         <sec:Answer>{Answer}</sec:Answer>
      </sec:UpdateQuestionRequest>
   </soapenv:Body>
</soapenv:Envelope>